lib/tasks/import.rake

  def import_stop(row)
    # {:stop_id=>"5129", :stop_code=>"153", :stop_name=>"\xD0\x90\xD0\xB5\xD1\x80\xD0\xBE\xD0\xBF\xD0\xBE\xD1\x80\xD1\x82", :stop_desc=>nil, :stop_lat=>"49.812833637475", :stop_lon=>"23.96170735359192", :zone_id=>"lviv_city", :stop_url=>nil, :location_type=>"0", :parent_station=>nil, :stop_timezone=>nil, :wheelchair_boarding=>"0"}
    [:stop_name, :stop_desc].each {|k| row[k] = row[k].to_s.force_encoding("UTF-8") }

    code = row[:stop_code].to_s.trimzero
    # raise "Empty code for #{row[:stop_desc]} (#{row[:stop_id]})" if code.empty?

    stop_name = row[:stop_name]
    ["00#{code}", "0#{code}", code, '()', '" "', '(Т6)', '(0)', 'уточнити' , /^"{1}/ , /\s+$/, "\\"].each { |s| stop_name.sub! s, '' }
    stop_name.sub! '""', '"'
    stop_name.sub! /"{1}$/, '' if stop_name.count('"') > 0 && 0 != stop_name.count('"') % 2

    # begin
    #   Integer(code)
    # rescue
    #   raise "Code #{row[:stop_code]} for #{row[:stop_desc]} is bad value"
    # end

    stop = Stop.find_or_initialize_by(external_id: row[:stop_id])

    stop.external_id = row[:stop_id]
    stop.code = code
    stop.name = stop_name
    stop.longitude = row[:stop_lon]
    stop.latitude = row[:stop_lat]
    stop.save
---
SELECT "stops".* FROM "stops" WHERE "stops"."external_id" = ? LIMIT ?  [["external_id", 4563], ["LIMIT", 1]]
UPDATE "stops" SET "external_id" = ?, "longitude" = ?, "latitude" = ?, "updated_at" = ? WHERE "stops"."id" = ?  [["external_id", 45011], ["longitude", 24.01809], ["latitude", 49.869264], ["updated_at", "2019-05-21 13:00:16.473109"], ["id", 611]]

  def import_route(row)
    # {:route_id=>"1002", :agency_id=>"52", :route_short_name=>"\xD0\x9005", :route_long_name=>"\xD0\x9C\xD0\xB0\xD1\x80\xD1\x88\xD1\x80\xD1\x83\xD1\x82 \xE2\x84\x96\xD0\x9005 (\xD0\xBC. \xD0\x92\xD0\xB8\xD0\xBD\xD0\xBD\xD0\xB8\xD0\xBA\xD0\xB8 - \xD0\xBF\xD0\xBB. \xD0\xA0\xD1\x96\xD0\xB7\xD0\xBD\xD1\x96)-\xD1\x80\xD0\xB5\xD0\xBC", :route_type=>"3", :route_desc=>nil, :route_url=>nil, :route_color=>nil, :route_text_color=>nil}

    route = Route.find_or_initialize_by(external_id: row[:route_id])
    [:route_short_name, :route_long_name].each {|k| row[k] = row[k].force_encoding("UTF-8") }

    route.name = row[:route_short_name].sub '-А', ''
    #route.name = "#{row[:route_short_name]}: #{row[:route_long_name]}"

    route.vehicle_type = case row[:route_type]
      when '0'
        Route::TRAM
      when '3'
        route.name.start_with?('Тр') ? Route::TROL : Route::BUS
      else
        Route::BUS
    end

    route.save
---
SELECT "routes".* FROM "routes" WHERE "routes"."external_id" = ? LIMIT ?  [["external_id", 88], ["LIMIT", 1]]
UPDATE "routes" SET "name" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["name", "Тр03"], ["updated_at", "2019-05-21 13:01:00.609897"], ["id", 42]]