lib/tasks/import.rake


      let_stops = let_stops.map { |code|
        s = Stop.find_by code: code
        routes = s.routes.map {|r|
---
SELECT "stops".* FROM "stops" WHERE "stops"."code" = ? LIMIT ?  [["code", 593], ["LIMIT", 1]]