app/controllers/stop_controller.rb

  def show
    stop_id = params[:id]
    stop = Stop.where(code: stop_id).first
---
SELECT "stops".* FROM "stops" WHERE "stops"."code" = ? ORDER BY "stops"."id" ASC LIMIT ?  [["code", 220], ["LIMIT", 1]]

  def closest
    coords = params.require [:longitude, :latitude]
    accuracy = 300.to_f / 1000 * 2

    point = coords.map {|c| c.to_f.round(3) }

    stops = Rails.cache.fetch("#{point.to_s}/closest_stops", expires_in: 24.hours) do
      Stop.in_lviv
        .within(accuracy, origin: point)
        .by_distance(origin: point)
        .map do |stop|
---
SELECT "stops".* FROM "stops" WHERE (stops.latitude>49.760845 AND stops.latitude<49.909403 AND stops.longitude>23.838736 AND stops.longitude<24.178282) AND (stops.latitude IS NOT NULL AND stops.longitude IS NOT NULL) AND (stops.latitude>49.831608955145306 AND stops.latitude<49.84239104485471 AND stops.longitude>24.027641328512058 AND stops.longitude<24.04435867148794) AND ((